# # -*- coding: utf-8 -*-
#
# # Атрибуты-данные аналогичны полям в терминологии большинства
# # распространённых языков программирования.
# # Атрибуты-данные не нужно описывать: как и переменные,
# # они создаются в момент первого присваивания.
#
#
# # Класс, описывающий человека
# c_ Person
#     p...
#
#
# # Создание экземпляров класса
#
# alex _ ?
# ?.name _ 'Alex'
# ?.age _ 18
#
# john _ ?
# ?.name _ 'John'
# ?.age _ 20
#
# # Атрибуты-данные относятся только к отдельным экземплярам класса
# # и никак не влияют на значения соответствующих атрибутов-данных
# # других экземпляров
# print(a__.n.. 'is' a__.a..
# print(j__.n.. 'is' j__.a..