# -*- coding: utf-8 -*-

arr = [1, 2, 3]
arr.append(4); print(arr)               # Добавляем число
# [1, 2, 3, 4]
arr.append([5, 6]); print(arr)          # Добавляем список
# [1, 2, 3, 4, [5, 6]]
arr.append((7, 8)); print(arr)          # Добавляем кортеж
# [1, 2, 3, 4, [5, 6], (7, 8)]


arr = [1, 2, 3]
arr.extend([4, 5, 6])                   # Добавляем список
arr.extend((7, 8, 9))                   # Добавляем кортеж
arr.extend("abc")                       # Добавляем буквы из строки
print(arr)
# [1, 2, 3, 4, 5, 6, 7, 8, 9, 'a', 'b', 'c']


arr = [1, 2, 3]
print(arr + [4, 5, 6])                   # Возвращает новый список
# [1, 2, 3, 4, 5, 6]
arr += [4, 5, 6]                         # Изменяет текущий список
print(arr)
# [1, 2, 3, 4, 5, 6]


arr = [1, 2, 3]
arr[len(arr):] = [4, 5, 6]               # Изменяет текущий список
print(arr)
# [1, 2, 3, 4, 5, 6]


arr = [1, 2, 3]
arr.insert(0, 0); print(arr)            # Вставляем 0 в начало списка
# [0, 1, 2, 3]
arr.insert(-1, 20); print(arr)          # Можно указать отрицательные числа
# [0, 1, 2, 20, 3]
arr.insert(2, 100); print(arr)          # Вставляем 100 в позицию 2
# [0, 1, 100, 2, 20, 3]
arr.insert(10, [4, 5]); print(arr)      # Добавляем список
# [0, 1, 100, 2, 20, 3, [4, 5]]


arr = [1, 2, 3]
arr[:0] = [-2, -1, 0]
print(arr)
# [-2, -1, 0, 1, 2, 3]


arr = [1, 2, 3, 4, 5]
print(arr.pop())                         # Удаляем последний элемент списка
# 5
print(arr)                               # Список изменился
# [1, 2, 3, 4]
print(arr.pop(0))                        # Удаляем первый элемент списка
# 1
print(arr)                               # Список изменился
# [2, 3, 4]


arr = [1, 2, 3, 4, 5]
del arr[4]; print(arr)                   # Удаляем последний элемент списка
# [1, 2, 3, 4]
del arr[:2]; print(arr)                  # Удаляем первый и второй элементы
# [3, 4]


arr = [1, 2, 3, 1, 1]
arr.remove(1)                            # Удаляет только первый элемент
print(arr)
# [2, 3, 1, 1]
# arr.remove(5)                          # Такого элемента нет
# Traceback (most recent call last):
#   File "<pyshell#3>", line 1, in <module>
#     arr.remove(5)    # Такого элемента нет
# ValueError: list.remove(x): x not in list


arr = [1, 2, 3, 1, 1]
arr.clear()
print(arr)
# []


arr = [1, 2, 3, 1, 1, 2, 2, 3, 3]
s = set(arr)                               # Преобразуем список во множество
print(s)
# {1, 2, 3}
arr = list(s)                              # Преобразуем множество в список
print(arr)                                 # Все повторы были удалены
[1, 2, 3]