# # -*- coding: utf-8 -*-
#
# ___ another_function func
#     """
#     Функция которая принимает другую функцию
#     """
#
#     ___ wrapper
#         """
#         Оберточная функция
#         """
#         val _ "The result of @ is @"  |?       # string
#                                           ev.. ?
#                                           ?
#
#         r_ v..
#
#     r_ ?
#
#
# ??
# ___ a_function
#     """Обычная функция"""
#     r_ "1+1"
#
#
# __ ______ __ ______
#     print(?. -n
#     print(?. -d
#
#
# # wrapper
# #
# # Оберточная функция
# # Это не правильно! Если вы запустите эту программу IDLE или в интерпретаторе, станет понятно,
# # насколько это может запутать.
#
# _____ f..._______ w..
#
#
# ___ another_function func
#     """
#     Функция которая принимает другую функцию
#     """
#
#     ?? ?
#     ___ wrapper
#         """
#         Оберточная функция
#         """
#         val _ "The result of @ is @"  ? ev.. ?
#         r_ ?
#
#     r_ ?
#
#
# ??
# ___ a_function
#     """Обычная функция"""
#     r_ "1+1"
#
#
# __ ______ __ ______
#     # a_function()
#     print(?. -n
# 
# # a_function
# # Обычная функция
