# ######################################################################################################################
# Пример использования комбинаторных генераторов модуля itertools

# f_ i_ _____ per____, comb____, combinations_with_replacement
#
# print(l_(per_ _ABC_ 2
# print()
#
# print(l_(comb_ _ABC_ 2
# print()
#
# print(l_(combinations_with_replacement _ABC_ 2
#
# print()
# ######################################################################################################################
# Пример использования функции product модуля itertools

from itertools import product

# ___ a, b __ p_ r_ 2 r_ 3
#     print a b
#
# print()

# ######################################################################################################################
# Пример использования комбинаторных генераторов модуля itertools

# f_ i_ i_ permut___ combin___ combin__w___repl___
#
# print(l_(per__ 'ABC' 2
# print()
#
# print(l_(com___ 'ABC' 2
# print()
#
# print(l_(com__w__rep_ 'ABC' 2
#
# print()
# ######################################################################################################################
# Пример использования функции product модуля itertools

# Пример использования функций takewhile и dropwhile модуля itertools

# f_ i_ i_ take__ drop__
#
# numbers = [1, 4, 6, 4, 1]
# predicate = l_ x| x < 5
#
# ___ value __ takewhile pred____ num____
#     print value
#
# print()
#
# ___ value __ dropwhile pred_____ num____
#     print value
#
# print()
# ######################################################################################################################
# Пример использования модуля operator

# f_ ope_ i___ neg mul le
# f___ f_ i___ re__ par__
#
# # Сделать числа списка отрицательными
# print(l_(m_(neg_ |2 4 8 9 1|)))
#
# # Вычислить произведение элементов списка
# print(r_(mul_ |3 4 5|
#
# # Оставить только числа, большие или равные пяти (используется оператор <=, так
# # как при помощи функции partial применяется первый аргумент, то есть условие
# # выглядит как 5 <= x).
# print(l_(f_(p_(le_ 5)_ |5 4 8 1 3 10|)))
#
# print()
# # ######################################################################################################################
