# # # -*- coding: utf-8 -*-
#
# """Пример использования модуля operator"""
#
# ____ o.. _____ neg, mul, le
# ____ f.. _____ re.. pa..
#
# # Сделать числа списка отрицательными
# print(li.. ma. n.. 2, 4, 8, 9, 1
#
# # Вычислить произведение элементов списка
# print(re.. ma. 3, 4, 5
#
# # Оставить только числа, большие или равные пяти (используется оператор <=, так
# # как при помощи функции partial применяется первый аргумент, то есть условие
# # выглядит как 5 <= x).
# print(li.. fi.. pa.. l. 5| |5, 4, 8, 1, 3, 10]
