# -*- coding: utf-8 -*-

_______ __
p _ __.c..(r"<(?P<tag1>[a-z]+)><(?P<tag2>[a-z]+)>")
p.s.. (r"<\2><\1>", "<br><hr>")             # \номер
# '<hr><br>'
p.s.. (r"<\g<2>><\g<1>>", "<br><hr>")       # \g<номер>
# '<hr><br>'
p.s.. (r"<\g<tag2>><\g<tag1>>", "<br><hr>") # \g<название>
# '<hr><br>'


# -*- coding: utf-8 -*-
_______ __
___ repl m
    """ Функция для замены. m — объект Match """
    x _ in. ?.g.. 0
    x +_ 10
    r_ "@".f.. ?

p _ __.c..(r"[0-9]+")
# Заменяем все вхождения
print ?.s.. ? "2008, 2009, 2010, 2011"
# Заменяем только первые два вхождения
print(p.s.. ? "2008, 2009, 2010, 2011", 2
input()


# -*- coding: utf-8 -*-
_______ __
___ repl m
    """ Функция для замены. m — объект Match """
    tag1 _ ?.g.. "?".u..
    tag2 _ ?.g.. "?" .u..
    r_ "<@><@>".f.. _2 _1
p _ r"<(?P<tag1>[a-z]+)><(?P<tag2>[a-z]+)>"
print __.s.. ? r.. "<br><hr>"
input()


p _ __.c..(r"[0-9]+")
p.s.. "0", "2008, 2009, 2010, 2011")
# ('0, 0, 0, 0', 4)


p _ r"200[79]"
__.s.. ?, "2001", "2007, 2008, 2009, 2010")
# ('2001, 2008, 2001, 2010', 2)


p _ __.c..(r"<(?P<tag1>[a-z]+)><(?P<tag2>[a-z]+)>")
m _ ?.s.."<br><hr>"
?.e..(r"<\2><\1>")             # \номер
# '<hr><br>'
?.e.. (r"<\g<2>><\g<1>>")       # \g<номер>
# '<hr><br>'
>.e.. (r"<\g<tag2>><\g<tag1>>") # \g<название>
# '<hr><br>'
