# # -*- coding: utf-8 -*-
#
# """Пример использования функции os.path.join
# для построения пути к файлу"""
#
# # Модуль, который содержит функции для работы с путями в файловой системе
# _______ __.p..
#
# ___ read_file fname
# 	"""Функция для чтения файла fname
# 	и вывода его содержимого на экран
# 	"""
#
# 	# Открытие файла для чтения
# 	file _ o.. ? _
#
# 	# Вывод названия файла
# 	print('File ' + ? + ':')
#
#     # Чтение содержимого файла построчно
# 	___ line __ ?
# 		# Вывод строки s.  Перевод строки в файле сохраняется в строке, поэтому
# 		# выводим без дополнительного перевода строки.
# 		print l.. e.._''
#
# 	# Закрытие файла
# 	?.c.
#
#
# __ _______ __ _____
#     # Функция os.path.join соединяет части пути в файловой системе требуемым
#     # для данной платформы разделителем
#     ? __.p___.j.. data file.txt
