#!/usr/bin/python
# -*- coding: utf-8 -*-

# if
# Basic Examples

# print('true')


# print('true')

# print('false')

# print()
# ######################################################################################################################
# if
# Multiway Branching
# killer rabbit
# x _ 'killer rabbit'
# roger
# print('How is Jessica')
# bugs
# print('What is up Doc?')

# print('Run away! Run away')

# print()
# ######################################################################################################################
# if
# Multiway Branching
# choice

# choice _ 'ham'
# print({'spam':  1.25,
#        'ham':   1.99,
#        'eggs':  0.99,
#        'bacon': 1.10}[choice])

#
# print(1.25)

# print(1.99)

# print(0.99)

# print(1.10)

# print('Bad choice')

# print()
# ######################################################################################################################
# if
# Handling switch defaults

# branch _ {'spam': 1.25,
#           'ham': 1.99,
#           'eggs': 0.99}

# print(branch.get('spam', 'Bad choice'))
# print(branch.get('bacon', 'Bad choice'))

# choice _ 'bacon'
# choice
# print(___)

# print('Bad choice')

# print()
# ######################################################################################################################
# if
# Parity check

# x _ _ "Введите число: "

# print(_ " - четное число")

# print(_ " - нечетное число")
# input()

# x "Введите число: "

# print(x _)
# print("- четное число")

# print(x _)
# print("- нечетное число")
# input()

# print()
# ######################################################################################################################
# if
# Check several conditions

# print("""Какой операционной системой вы пользуетесь?
# 1 — Windows 8
# 2 — Windows 7
# 3 — Windows Vista
# 4 — Windows XP
# 5 — Другая""")
# os "Введите число, соответствующее ответу: "

# print("Вы выбрали: Windows 8")

# print("Вы выбрали: Windows 7")

# print("Вы выбрали: Windows Vista")

# print("Вы выбрали: Windows XP")

# print("Вы выбрали: другая")

# print("Вы не ввели число")

# print("Мы не смогли определить вашу операционную систему")
# input()

# print()
# ######################################################################################################################
# if
# Enclosed instructions

# print("""Какой операционной системой вы пользуетесь?
# 1 — Windows 8
# 2 — Windows 7
# 3 — Windows Vista
# 4 — Windows XP
# 5 — Другая""")
# os ("Введите число, соответствующее ответу: ")


# print("Вы выбрали: Windows 8")

# print("Вы выбрали: Windows 7")

# print("Вы выбрали: Windows Vista")

# print("Вы выбрали: Windows XP")

# print("Вы выбрали: другая")

# print("Мы не смогли определить вашу операционную систему")

# print("Вы не ввели число")
# input()

# print()
# ######################################################################################################################
# Оператор if ... else имеет еще один формат:
# <Переменная> = <Если истина> if <Условие> else <Если ложь>
# print("Yes" if 10 % 2 __ 0 else "No")
# Yes
# s = "Yes" if 10 % 2 __ 0 else "No"
# s
# 'Yes'
# s _ "Yes" if 11 % 2 __ 0 else "No"
# s
# 'No'

# print()
# ######################################################################################################################
# if
# 'friend' example
# friend _ "Rolf"
# user_name "Enter your name: "

# print("Hello, friend!")

# print("Hello, stranger!")

# print()
# ######################################################################################################################
# if
# Using the `in` keyword
# friends _  "Rolf", "Bob", "Anne"   # list
# family _  "Jen", "Charlie"         # list

# user_name "Enter your name: "


# print("Hello, friend!")

# print("Hello, family!")

# print("I don't know you.")

# print()
# ######################################################################################################################
# simple-if
# x 'x = '
# Если число x больше пяти, то будет выдано
# соответствующее сообщение
# x > 5
# print('x больше пяти')

# print()
# ######################################################################################################################
# if else
# x 'x = '
# x > 0
# y = x ** 0.5

# y = x ** 2
# print(y)

# print()
# ######################################################################################################################
# nested-if-else
# x 'x = '

# 0 < x < 7
# print('Значение x входит в заданный диапазон, продолжаем')
# y = 2 * x - 5
# y < 0:
# print('Значение y отрицательно')

# y > 0
# print('Значение y положительно')

# print('y = 0')

# print()
# ######################################################################################################################
# nested-if-else-with-elif
# x 'x = '
# Заменим второй вложенный if в предыдущем примере
# на оператор ветвления с несколькими условиями
# 0 < x < 7
# print('Значение x входит в заданный диапазон, продолжаем')
# y = 2 * x - 5
# y < 0:
# print('Значение y отрицательно')
# y > 0:
# print('Значение y положительно')

# print('y = 0')

# print()
# ######################################################################################################################
# elif-switch
# print('''Меню:
#       1. Файл
#       2. Вид
#       3. Выход
# ''')

# choice 'Ваш выбор: '

# print('Вы выбрали пункт меню "Файл"')

# print('Вы открыли меню "Вид"')

# print('Завершение.')

# print('Некорректный выбор')

# print()
# ######################################################################################################################
# if
# no-conditional-expression
# is_ready _ True

# Присваиваем значение переменной в зависимости от условия

# 'Ready'

# 'Not ready yet'

# print(state_msg)

# print()
# ######################################################################################################################
# if
# conditional-expression
# is_ready _ True

# То же самое, что и в предыдущем примере, но используем
# условное выражение вместо условного оператора
# state_msg = 'Ready' ____ 'Not ready yet'
# print(state_msg)

# print()
# ######################################################################################################################
# if
# truth-value-testing
# string 'Enter a string: '
# то же самое, что if string is not None and string != ''

# print('The string is {}')

# number input('Enter a number: '

# print('Число не равно нулю')

# print('Число равно нулю')

# print()