# Строка-разделитель выводиться не будет
x = 'spam'
y = 99
z = ['eggs']

# Нестандартная строка-разделитель
x = 'spam'
y = 99
z = ['eggs']

# Подавление вывода символа конца строки
x = 'spam'
y = 99
z = ['eggs']

# Вывод двух строк в одной строке
x = 'spam'
y = 99
z = ['eggs']

# Нестандартный разделитель строк
x = 'spam'
y = 99
z = ['eggs']

# Несколько именованных аргументов
x = 'spam'
y = 99
z = ['eggs']

# Порядок не имеет значения
x = 'spam'
y = 99
z = ['eggs']

# Вывод в файл
x = 'spam'
y = 99
z = ['eggs']

# Вывод содержимого текстового файла
x = 'spam'
y = 99
z = ['eggs']

# Сохранить для последующего восстановления
x = 'spam'
y = 99
z = ['eggs']

# # # Перенаправить вывод в файл

# # # Выведет в файл, а не на экран

# # # Вытолкнуть буферы на диск

# # # Восстановить первоначальный поток

# # # Результаты более ранних обращений


# В версии 3.0 именованный аргумент file позволяет перенаправить в файл вывод единственного вызова функции print,
# не прибегая к переустановке значения sys.stdout.

x = 'spam'
y = 99
z = ['eggs']

# # 3.0

# # # Вывести в объект, напоминающий файл

# # # Вывести в оригинальный поток вывода

# Эти способы перенаправления удобно использовать, когда в одной и той же программе необходимо организовать
# вывод и в файл, и в стандартный поток вывода. Однако если вы собираетесь использовать эти формы вывода,
# вам потребуется создать объект-файл (или объект, который имеет метод write, как и объект
# файла) и передавать инструкции этот объект, а не строку с именем файла:

x = 'spam'
y = 99
z = ['eggs']

log = None

# Эти расширенные формы инструкции print нередко используются для вывода сообщений об ошибках в стандартный
# поток ошибок, sys.stderr. Вы можете либо использовать его метод write и форматировать выводимые строки вручную,
# либо использовать синтаксис перенаправления:

# вывод текста обоими способами в версии 3.0,
# перенаправление вывода во внешний файл и выполняется проверка содержимого текстовых файлов:
X = 1; Y = 2

# # # Вывод: простой способ

# # # Вывод: сложный способ

# # # Перенаправление в файл

# # # Запись в файл

# # # Двоичный режим