# # -*- coding: utf-8 -*-
#
# # В Python всё является объектами, в том числе
# # и сами классы
#
#
# # Объявление пустого класса MyClass
# c_ MyClass
#     p__
#
# # Создание экземпляра класса
# obj _ ?
#
# # Объект obj -- это экземпляр класса MyClass,
# # то есть он имеет тип MyClass
# print ty.. ?   # <class '__main__.MyClass'>
#
# # MyClass -- это класс, но также он является
# # и объектом, экземпляром метакласса type,
# # являющегося абстракцией понятия типа данных
# print ty.. M..   # <class 'type'>
#
# # Соответственно, с классами работать как
# # с объектами, например, копировать
# AnotherClass = ?
# print ty.. ?
#
# # Как видим, теперь AnotherClass -- это то же самое, что и MyClass,
# # и obj является и экземпляром класса AnotherClass
# print isi o.. A..   # True