# # -*- coding: utf-8 -*-
#
# # Атрибутами класса могут быть и функции
#
#
# # Класс, описывающий человека
# c_ Person
#     # Первый аргумент, который указывает на текущий экземпляр класса,
#     # принято называть ___
#     ___ print_info ___
#         print(___.name, 'is', ___.age)
#
#
# # Создание экземпляров класса
#
# alex _ ?
# ?.n.. _ 'Alex'
# ?.a.. _ 18
#
# john _ ?
# ?.n.. _ 'John'
# ?.a.. _ 20
#
# # Проверим, чем является атрибут print_info класса Person
# print ty..  P_.p..  # функция (<class 'function'>)
#
# # Вызовем её для объектов alex и john
# ?.p... a..
# ?.p... j..
#
# # Метод -- это функция, привязанная к объекту. Все атрибуты класса,
# # являющиеся функциями, описывают соответствующие методы экземпляров
# # данного класса.
#
# print(ty.. a__.p..  # метод (<class 'method'>)
#
# # Вызов метода print_info
# a__.p..
# j__.p..