# # -*- coding: utf-8 -*-
#
# # Атрибуты-данные аналогичны полям в терминологии большинства
# # распространённых языков программирования.
# # Атрибуты-данные не нужно описывать: как и переменные,
# # они создаются в момент первого присваивания.
#
#
# # Класс, описывающий человека
# c_ Person
#     p..
#
#
# # Создание экземпляров класса
#
# alex = ?
# ?.name = 'Alex'
# ?.age = 18
#
# john = ?
# ?.name = 'John'
# ?.age = 20
#
# # Атрибуты-данные относятся только к отдельным экземплярам класса
# # и никак не влияют на значения соответствующих атрибутов-данных
# # других экземпляров
# print(?.name, 'is', ?.age)
# print(?.name, 'is', ?.age)