# # -*- coding: utf-8 -*-
#
# """Пример открытия файла для чтения"""
#
# ___ read_file fname
# 	"""Функция для чтения файла fname
# 	и вывода его содержимого на экран
# 	"""
#
# 	# Открытие файла для чтения
# 	file _ o.. ? _
#
# 	# Вывод названия файла
# 	print('File ' + ? + ':'
#
#     # Чтение содержимого файла построчно
# 	___ line __ ?
# 		# Вывод строки s.  Перевод строки в файле сохраняется в строке, поэтому
# 		# выводим без дополнительного перевода строки.
# 		print l.. e.._''
#
# 	# Закрытие файла
# 	?.c..
#
#
# __ _______ __ _____
#     ? data/file.txt
