# # -*- coding: utf-8 -*-

# # Декораторы - это просто функции
# ___ my_decorator func
#     print Я обычная функция
#
# ___ wrapper
#         print Я - функция, возвращаемая декоратором
#         ?
#
#     r_ ?
#
#
# # Так что, мы можем вызывать её, не используя "@"-синтаксис:
#
# ___ lazy_function
#     print zzzzzzzz
#
#
# decorated_function _ my_ ?
#
#
# # выведет: Я обычная функция
#
# # Данный код выводит "Я обычная функция", потому что это ровно то, что мы сделали:
# # вызвали функцию. Ничего сверхъестественного
#
# ??
# ___ lazy_function
#     print zzzzzzzz
#
# # выведет: Я обычная функция
