#!/usr/bin/env python
# -*- coding: utf-8 -*-

"""
    Простой пример Unittest Framework
"""

______ u__


c_ BaseTestClass?.?
    """
        объявление Test Class'а. Для распознавания функций в
        классе и интерпретации их как тесты, необходимо чтобы
        класс наследовался от unittest.TestCase и тесты в
        классе должны начинаться с префикса test
    """

    ___ test_add
        aE..(120, 100+20)
        aF..(10 > 20)
        aG..(120, 100)

    ___ test_sub
        aE..(100, 140 - 40)

__ _____ __ _____
    # Запуск всех тестов в текущем модуле.
    ?.?