# -*- coding: utf-8 -*-

# # Как и для других расмотренных типов данных, для типа list
# # существует соответствующая функция-конструктор, которая
# # создаёт список из значения другого типа.
#
# # Создание пустого списка
# empty_list = l..
# print ?
#
# # Создание списка из последовательности range
# # (актуально для Python 3.x; в Python 2.x range
# # и так возвращает список, а последовательность
# # создаёт функция xrange)
# numbers = li.. ra.. 1000
# print ?
#
# # Создание списка символов из строки
# chars = li.. "a string"
# print ?