# # -*- coding: utf-8 -*-
# print("""Какой операционной системой вы пользуетесь?
# 1 — Windows 8
# 2 — Windows 7
# 3 — Windows Vista
# 4 — Windows XP
# 5 — Другая""")
# os _ in.. ("Введите число, соответствующее ответу: ")
# __ ? !_ ""
#     __   ? __ "1"
#         print("Вы выбрали: Windows 8")
#     ____ ? __ "2"
#         print("Вы выбрали: Windows 7")
#     ____ ? __ "3"
#         print("Вы выбрали: Windows Vista")
#     ____ ? __ "4"
#         print("Вы выбрали: Windows XP")
#     ____ ? __ "5"
#         print("Вы выбрали: другая")
#     ____
#         print("Мы не смогли определить вашу операционную систему")
# ____
#     print("Вы не ввели число")
# input()
#
#
# print("Yes" __ 10 % 2 __ 0 ____ "No")
# # Yes
# s = "Yes" __ 10 % 2 __ 0 ____ "No"
# s
# # 'Yes'
# s = "Yes" __ 11 % 2 __ 0 ____ "No"
# s
# # 'No'