# # # -*- coding: utf-8 -*-
#
# ______ __
# __.g...()               # Текущий рабочий каталог
# # 'C:\\book'
#
#
# __.c... C:\\book\\folder1\\
# __.g...               # Текущий рабочий каталог
# # 'C:\\book\\folder1'
# # ######################################################################################################################
#
# __.m... newfolder    # Создание каталога
# __.r... newfolder # Удаление каталога
#
# __.l... C:\\book\\folder1\\
# # ['file1.txt', 'file2.txt', 'file3.txt', 'folder1', 'folder2']
# # ######################################################################################################################
#
# ___ p, d, f i_ __.w.. C:\\book\\folder1\\
#     print p
#
# # C:\book\folder1\
# # C:\book\folder1\folder1_1
# # C:\book\folder1\folder1_1\folder1_1_1
# # C:\book\folder1\folder1_1\folder1_1_2
# # C:\book\folder1\folder1_2
# # ######################################################################################################################
#
# ___ p, d, f i_ __.w.. C:\\book\\folder1\\ F..
#     print(p)
#
# # C:\book\folder1\folder1_1\folder1_1_1
# # C:\book\folder1\folder1_1\folder1_1_2
# # C:\book\folder1\folder1_1
# # C:\book\folder1\folder1_2
# # C:\book\folder1\
# # ######################################################################################################################
#
#
# ______ __
# ___ p, d, f i_ __.w... C:\\book\\folder1\\ F..
#     ___ file_name i_ f # Удаляем все файлы
#         __.r.. __.p___.j___ p f.._n..
#     ___ dir_name i_ d # Удаляем все каталоги
#         __.r... __.p___.j.. p d.._n..
#
#
# ______ sh..
# sh__.rm.. C:\\book\\folder1\\
#
#
# from __.p.. ______ n..c..
# normcase _ c:/BoOk/fIlE.TxT
# # 'c:\\book\\file.txt'
# # ######################################################################################################################
#
# ______ __.p..
# __.p___.i.d. _ C:\book\file.txt
# # False
# __.p___.i.d. C:\\book\\
# # True
# # ######################################################################################################################
#
# __.p___.i.f. _ C:\book\file.txt
# # True
# __.p___.i.f. C:\\book\\
# # False
# # ######################################################################################################################