# # -*- coding: utf-8 -*-
#
# #prepare-data.py
#
# _____ p__, r__
#
# path = p__.? '.'
# # название тестовой директории
# test_dir  'test_dir'
# # Путь к тестовой директории
# path_dir  ?.j.. ?
# # создаем тестовый директорий
# ?.m.. e..._T..
# # количество создаваемых файлов
# n_files  50
#
# # скобочки {} - это шаблон для метода строки
# # str.format() туда вставим имя файла
# line = "{} - We will write this line to a file "
#
#
# __ ?.i..
#     ___ n __ r.. ?
#         # название файла
#         f_name = _*file-?.txt
#         # путь к файлу
#         path_file = ?.j.. ?
#         # Генерируем разное количество строк,
#         # которые будут писаться в файл
#         data = ?.f.. ? ___ _ __ r.. r__.r.. 5000 15000
#         # пишем данные в файл
#         ?.w.. '\n'.j.. ?