# _____ _ t__
#
#
# ___ worker num_thread
#     print _*Старт потока № ?
#     t__.s.. 1
#     print _*Завершение работы потока № ?
#
#
# ___ i __ r.. 2
#     # создаем экземпляры 'Thread' с функцией
#     # 'worker()', которая запустится в отдельных
#     # трех потоках. Позиционные аргументы для
#     # функции 'worker()' передаются в кортеже `args`
#     thread = _.? t.. ? a.. ?
#     # запускаем экземпляр `thread`
#     ?.s..
#
# # Старт потока №0
# # Старт потока №1
# # Завершение работы потока №0
# # Завершение работы потока №1