# _____ _, t__
#
#
# c_ Worker _.?
#
#     ___  -  num_thread
#         # вызываем конструктор базового класса
#         s.. . -
#         # определяем аргументы собственного класса
#         ?  ?
#
#     ___ run
#         # теперь код функции 'worker()', которая должна
#         # выполняться в отдельных потоках будет здесь
#         print _*Старт потока № ?
#         t__.s.. 1
#         print _* Завершение работы потока № ?
#
#
# ___ i __ r.. 2
#     # Создаем экземпляры класса 'Worker()'
#     th  ? ?
#     # запускаем потоки
#     ?.s..
#
# # Старт потока №0
# # Старт потока №1
# # Завершение работы потока №0
# # Завершение работы потока №1