# _____ _ t__
#
#
# ___ worker barrier
#     th_name = _.c...n..
#     print _* ? в ожидании барьера с ?.n.. другими
#     worker_id = ?.w..
#     print _* ? прохождение барьера ?
#
#
# # число потоков, при использовании
# # барьеров оно должно быть постоянным
# NUM_THREADS = 3
#
# # установка барьера
# barrier  _. ? ?
#
# threads   # lsit
# # создаем и запускаем потоки
# ___ i __ r.. ?
#     th = _.?(n.. _*Worker-?
#                           t.. ?
#                           a.. ?
#
#     ?.a.. ?
#     print _*Запуск ?.n..
#     ?.s..
#     t__.s.. 0.3
#
# # блокируем основной поток программы
# # до завершения работы всех потоков
# ___ thread __ ?
#     ?.j..
#
# # Запуск Worker-0
# # Worker-0 в ожидании барьера с 0 другими
# # Запуск Worker-1
# # Worker-1 в ожидании барьера с 1 другими
# # Запуск Worker-2
# # Worker-2 в ожидании барьера с 2 другими
# # Worker-2 прохождение барьера 2
# # Worker-0 прохождение барьера 0
# # Worker-1 прохождение барьера 1