# # -*- coding: utf-8 -*-
#
# """Использование конструкторов"""
#
# # Пустое множество
# empty_set _
# print ?
#
# # Пустое неизменяемое множество
# empty_frozenset =
# print ?
#
# # Создание множеств из итерабельых объектов
#
# my_frozenset = f.. 4, 1, 3, 8
# my_set = s.. ?
# print ?
# print my_f..
#
# ___ get_ints n
#     ___ i __ ra.. n
#         y___ ?
#         y___ ? + 1
#
# print li.. ? 10  # все числа, возвращаемые генератором
# print se. ? 10   # множество содержит лишь уникальные значения