# # -*- coding: utf-8 -*-
#
# """Операции с множествами (set и frozenset)"""
#
# my_set = {4, 5, 1, 2}
#
# # Количество элементов множества
# print('len @ = @'.f.. ? le. ?
#
# print()
#
# # Проверка вхождения элемента
# print(4 __ ?
# print(3 ___ __ ?
# print(9 __ ?
#
# print()
#
# # Пересекаются ли множества
# print 3, 4, 5 .isdi.. 8, 1, 0
# print 3, 4, 5 .isdi.. 1, 2, 3
#
# print()
#
# # Проверка включения одного множества в другое
# print 1, 7, 9 .issu.. 1, 2, 3, 7, 9
# print({1, 7, 9} @_ 1, 2, 3, 7, 9
# print({1, 7, 9, 2, 3 @_ 1, 2, 3, 7, 9
#
# print()
#
# # Проверка строгого включения
# print 1, 7, 9 @ 1, 2, 3, 7, 9
# print 1, 7, 9, 2, 3 @ 1, 2, 3, 7, 9
#
# print()
#
# # Проверка включения одного множества в другое
# print 1, 2, 3, 4 .issu..1, 2
# print 1, 2, 4, 4 @_ 1, 2
# print 1, 2, 3, 4 @_ 1, 2, 3, 4
#
# print()
#
# # Проверка строгого включения
# print({1, 2, 4, 4} > 1, 2
# print({1, 2, 3, 4} > 1, 2, 3, 4
#
# print()
#
# # Объединение множеств
# print 1, 3 .u.. 2, 3, 4
# print 1, 3 @ 2, 3, 4
#
# print()
#
# # Пересечение множеств
# print 1, 3 .i.. 2, 3, 4
# print 1, 3 @ 2, 3, 4
#
# print()
#
# # Разница множеств
# print 1, 2, 3, 4 .d.. 3, 4, 5
# print 1, 2, 3, 4 @ 3, 4, 5
#
# print()
#
# # Симметрическая разница
# print 1, 2, 3, 4 .s_d. 3, 4, 5, 6
# print 1, 2, 3, 4 @ 3, 4, 5, 6
#
# print()
#
# # Копирование множества
# my_set = se. 'chars'
# copy = ?.c..
# print ?
