# # -*- coding: utf-8 -*-
#
# """Операции над множествами, которые являются методами, принимают в качестве
# аргументов любые итерабельные объекты. Операции над множествами, записанные
# в виде бинарных операций, требуют, чтобы второй операнд операции тоже был
# множеством, и возвращают множество того типа, которым было первое множество
# """
#
# print f.. abc .u.. f..  cdef  # корректно
# print f... abc @ f... cdef  # корректно
# print f... abc .u.. cdef  # корректно
# print f... abc  | 'cdef')  # ошибка
