# Создание строки
# Если указан только первый параметр, то функция возвращает строковое представление любого объекта.
# Если параметры не указаны вообще, то возвращается пустая строка
# # # #  empty string

# # # # list

# # # # tuple

# # # # dictionary

# obj1 _ None  # b..
# obj2 _ None  # b..
             # s..(' ...', '...')
             # s..(' ...', '...', '...')

# Создание строки - ' ' or " "

# Экранированные последовательности
# Сам символ обратного слеша (остается один символ \)
# print()
# Экранированные последовательности
# Апостроф (остается один символ ‘)
# print()
# Экранированные последовательности
# Кавычка (остается один символ “)
# print()
# Экранированные последовательности
# Звонок
# print()
# Экранированные последовательности
# Забой
# ASCII backspace ( BS ) removes previous character
# print()
# Экранированные последовательности
# Перевод формата
# print()
# Экранированные последовательности
# Новая строка (перевод строки)
# print()
# Экранированные последовательности
# Возврат каретки
# print()
# Экранированные последовательности
# Горизонтальная табуляция
# print()
# Экранированные последовательности
# Вертикальная табуляция
# print()
# Экранированные последовательности
# Символ с шестнадцатеричным кодом hh
# (не более 2 цифр)
# print()
# Экранированные последовательности
# Символ с восьмеричным кодом ooo (не более 3 цифр)
# print()
# Экранированные последовательности
# Символ Null (не признак конца строки)
# print()
# Экранированные последовательности
# Идентификатор ID базы данных Юникода
# print()
# Экранированные последовательности
# 16-битный символ Юникода в шестнадцатеричном
# представлении
# print()
# Экранированные последовательности
# 32-битный символ Юникода в шестнадцатеричном
# представленииa
# print()
# Неформатированные строки подавляют экранирование
# myfile = open(r'C:\new\text.dat', 'w')
