# ______ ...
#
# print ___.a..
# current = ___.c..
# print ?.g..
# print ?.i..
# # что произойдет, если попробуем еще раз его запустить
# ___
#     ?.s..
# ______ R.. __ e
#     print('ERROR: |er..'.f.. e.._?
# ?.s..'SuperThread'
# print ?.g..
#
# # на самом деле setName, getName - это просто старый интерфейс.
# # В реальных задачах вы смело можете работаь напрямую с атрибутом name
# ?.name = 'SuperThread1'
# print ?.n..
# print ?.g..
#
# # вывод всех запущенных и живых трэдов
# print ___.en..
#
# # Напишем пример для демонстрации потокобезопасного хранилища данных.
# thread_data _ ___.l..
# ?.v.. _ 5
#
#
# ___ print_results
#     print ___.c..
#     print('Result: @'.f.. t___.v..
#
#
# ___ counter started to_value
#     print h.. t.. 'value'
#     t__.v.. _ ?
#     ___ i __ ra.. ?
#         t__.v.. +_ 1
#     ?
#
#
# task1 = ___.T.. t.._? a.._(0, 10), n.._'Task1'
# task2 = ___.T.. t.._c.. a.._(100, 3), n.._'Task2')
# ?.n.. = *?
# ?.n.. = *?
#
# ?.s..
# ?.s..
#
# p..
#
# ?.j..
# ?.j..
# p..
