# # -*- coding: utf-8 -*-
#
# c_ MyClass
#     ___ - ____
#         ____.x = 10
#     ___ get_x ____
#         r_ ____.x
# c = ?               # Создаем экземпляр класса
# print g.. c "x"         # Выведет: 10
# print(g..(c "get_x"  # Выведет: 10
# print(g..(c "y", 0  # Выведет: 0, т. к. атрибут не найден
# s... c "y" 20)           # Создаем атрибут y
# print g.. c "y" 0     # Выведет: 20
# d... c "y")                # Удаляем атрибут y
# print g.. c "y" 0   # Выведет: 0, т. к. атрибут не найден
# print h... c "x"        # Выведет: True
# print h... c "y"        # Выведет: False
