# # -*- coding: utf-8 -*-

# ___ hello_world
#     print Hello world!
#
# print type hello_world
#
#
# c___ Hello
#     p__
#
# print type Hello
#
# print ty.. 10
#
# # Как вы заметили, функция hello_world принадлежит типу <class 'function'>. Это означает,
# # что она является объектом класса function. Кроме того, класс, который мы определили, принадлежит классу type.
# # От этого всего голова может пойти кругом, но чуть поигравшись с функцией type вы со всем разберётесь.
# #
# # Теперь давайте посмотрим на функции в качестве объектов первого класса.
#
# # Мы можем хранить функции в переменных:
#
# hello _ ?
# ?
#
# # Определять функции внутри других функций:
#
# ___ wrapper_function
#     ___ hello_world
#         print Hello world!
#     ?
#
# ?
#
# # Hello world!
# # Передавать функции в качестве аргументов и возвращать их из других функций:
#
# ___ higher_order func
#     print Получена функция @ в качестве аргумента f.. ?
#     ?
#     r_ ?
#
# ? he..
# # Получена функция <function hello_world at 0x032C7FA8> в качестве аргумента
# # Hello world!
# # <function hello_world at 0x032C7FA8>
