# # -*- coding: utf-8 -*-
#
# name _ N..  # вначале мы не знаем имени пользователя
#
# # бесконечный цикл
# ____ T..
#     print('Меню:')
#     print('1. Ввести имя')
#     print('2. Вывести приветствие')
#     print('3. Выйти')
#     response _ in.. ('Выберите пункт: ')
#
#     print()
#
#     __ ? __ '1'
#         name = in.. 'Введите ваше имя: ')
#     ____ ? __ '2':
#         __ ?  # здороваемся с пользователем, если имя уже введено
#             print('Привет, ', n.. '!', s.._'')
#         ____
#             print('Я не знаю вашего имени.')
#     ____ ? __ '3'
#         # оператор break завершает выполнение цикла
#         b...  # если пользователь выбрал третий пункт, то выходим из цикла
#     _____
#         print('Неверный ввод.')
#
#     print()