# # -*- coding: utf-8 -*-
# x = in.  in. .("Введите число: "
# __ ? % 2 __ 0
#     print ? " - четное число")
# ____:
#     print ? " - нечетное число")
# input()
#
#
# # -*- coding: utf-8 -*-
# x = in. (in. .("Введите число: "
# __ ? % 2 __ 0 print ? " - четное число")
# ____: print ? " - нечетное число")
# input()
#
#
# # -*- coding: utf-8 -*-
# x = in. (in. .("Введите число: "
# __ ? % 2 __ 0 print ? e.._" " print("- четное число")
# ____: print ? e.._" "); print("- нечетное число")
# input()
#
#
# # -*- coding: utf-8 -*-
# x = in.  in. . "Введите число: "
# __ ? % 2 __ 0
#     print ? e
#     .._" "
#     print("- четное число")
# ____:
#     print ? e._" "
#     print("- нечетное число")
# input()
