# # -*- coding: utf-8 -*-
#
# print("_" _ 10                         # Один элемент
# # '10'
# print("_ — _ — _" _ (10, 20, 30))     # Несколько элементов
# '10 — 20 — 30'
#
#
# print("_ name _ — _ year _" _ "year" 1978 "name" "Nik"
# # 'Nik — 1978'
#
#
# print("_#o _#o _#o" _ 0o77, 10, 105
# # 0o77 0o12 0o12
# print("_#x _#x _#x" _ 0xff, 10, 105
# # 0xff 0xa 0xa
# print("_#X _#X _#X" _ 0xff, 10, 105
# # 0XFF 0XA 0XA
# print("_#.0F _.0F" _ 300, 300
# # 300. 300
#
#
# print("'_d' — '_##_'" _ 3, 3  # 5 — ширина поля
# # "'3' — '00003'"
#
# print("'_##' — '_-##'" _ (3, 3))  # 5 — ширина поля
# # "'    3' — '3    '"
# print("'_##' — '_-##'" _ (3, 3))
# # "'00003' — '3    '"
#
#
# print("'_ _' — '_ '" _ (-3, 3))
# # "'-3' — ' 3'"
#
# print("'_+_' — '_+_'" _ (-3, 3))
# # "'-3' — '+3'"
#
#
# print("'_10_' — '_-10_'" _ (3, 3))
# # "'         3' — '3         '"
# print("'_3_''_10_'" _ ("string", "string"))
# # "'string''    string'"
#
#
# print("'_*_''_10_'" _ (10, "string", "str"))
# # "'    string''       str'"
#
#
# _______ ma__
# print("_ _f _.2_" _ ma__.pi, ma__.pi, ma__.pi))
# # '3.141592653589793 3.141593 3.14'
#
#
# print("'_*.*_'" _ (8, 5, ma__.pi))
# # "' 3.14159'"
#
#
# print("_" _ ("Обычная строка"))
# # Обычная строка
# print("_ _ _" _ (10, 10.52, [1, 2, 3]))
# # 10 10.52 [1, 2, 3]
#
#
# print("_r" _ ("Обычная строка"))
# # 'Обычная строка'
#
#
# print("_a" _ ("строка"))
# # '\u0441\u0442\u0440\u043e\u043a\u0430'
#
#
# ___ i i_ ra.. 33, 127
#   print("_ => _c" _ ? ?
#
#
# print("_d _d _d" _ (10, 25.6, -80))
# # 10 25 -80
# print("_i _i _i" _ (10, 25.6, -80))
# # 10 25 -80
#
#
# print("_o _o _o" _ (0o77, 10, 105))
# # 77 12 12
# print("_#o _#o _#o" _ (0o77, 10, 105))
# # 0o77 0o12 0o12
#
#
# print("_x _x _x" _ (0xff, 10, 105))
# # ff a a
# print("_#x _#x _#x" _ (0xff, 10, 105))
# # 0xff 0xa 0xa
#
#
# print("_X _X _X" _ (0xff, 10, 105))
# # FF A A
# print("_#X _#X _#X" _ (0xff, 10, 105))
# # 0XFF 0XA 0XA
#
#
# print("_f _f _f" _ (300, 18.65781452, -12.5))
# # 300.000000 18.657815 -12.500000
# print("_F _F _F" _ (300, 18.65781452, -12.5))
# # 300.000000 18.657815 -12.500000
# print("_#.0F _.0F" _ (300, 300))
# # 300. 300
#
#
# print("_e _e" _ (3000, 18657.81452))
# # 3.000000e+03 1.865781e+04
#
#
# print("_E _E" _ (3000, 18657.81452))
# # 3.000000E+03 1.865781E+04
#
# print("_g _g _g" _ (0.086578, 0.000086578, 1.865E-005))
# # 0.086578 8.6578e-05 1.865e-05
#
# print("_G _G _G" _ (0.086578, 0.000086578, 1.865E-005))
# # 0.086578 8.6578E-05 1.865E-05
#
# # print("_ _" _ ("- это символ процента")) # Ошибка
# # Traceback (most recent call last):
# #   File "<pyshell#55>", line 1, in <module>
# #     print("_ _" _ ("- это символ процента")) # Ошибка
# # TypeError: not all arguments converted during string formatting
# print("__ _" _ ("- это символ процента")) # Нормально
# # _ — это символ процента