# # -*- coding: utf-8 -*-
#
# # Атрибуты-данные аналогичны полям в терминологии большинства
# # распространённых языков программирования.
# # Атрибуты-данные не нужно описывать: как и переменные,
# # они создаются в момент первого присваивания.
#
#
# # Класс, описывающий человека
# c_ Person
#     p__
#
#
# # Создание экземпляров класса
#
# alex = ?
# a__.n.. _ Alex
# a__.a.. _ 18
#
# john _ ?
# j__.n.. _ John
# j__.a.. _ 20
#
# # Атрибуты-данные относятся только к отдельным экземплярам класса
# # и никак не влияют на значения соответствующих атрибутов-данных
# # других экземпляров
# print(a__.n.. 'is' a__.a..
# print(j__.n.. 'is' j__.a..