# # -*- coding: utf-8 -*-
#
# # Атрибутами класса могут быть и функции
#
#
# # Класс, описывающий человека
# c__ Person
#     # Первый аргумент, который указывает на текущий экземпляр класса,
#     # принято называть self
#     ___ print_info____
#         print ____.name, 'is', ____.age
#
#
# # Создание экземпляров класса
#
# alex _ ?
# a_.n... _ 'Alex'
# a_.a.. _ 18
#
# john _ ?
# j_.n... _ 'John'
# j_.a.. _ 20
#
# # Проверим, чем является атрибут print_info класса Person
# print ty.. ?.p...  # функция (<class 'function'>)
#
# # Вызовем её для объектов alex и john
# ?.p... a_
# ?.p... j_
#
# # Метод -- это функция, привязанная к объекту. Все атрибуты класса,
# # являющиеся функциями, описывают соответствующие методы экземпляров
# # данного класса.
#
# print(ty.. a_.p...  # метод (<class 'method'>)
#
# # Вызов метода p...
# a_.p...
# j_.p...