# ___ hello_world
#     print Hello world!
#
# print type hello_world
#
#
# c___ Hello
#     p__
#
# print type Hello
#
# print type 10
#
# # Как вы заметили, функция hello_world принадлежит типу <class 'function'>. Это означает,
# # что она является объектом класса function. Кроме того, класс, который мы определили, принадлежит классу type.
# # От этого всего голова может пойти кругом, но чуть поигравшись с функцией type вы со всем разберётесь.
# #
# # Теперь давайте посмотрим на функции в качестве объектов первого класса.
#
# # Мы можем хранить функции в переменных:
#
# hello _ h000_w0000
# h000__
#
# # Определять функции внутри других функций:
#
# ___ wrapper_function
#     ___ hello_world
#         print Hello world!
#     h000_w0000
#
# w0000_f00000
#
# # Hello world!
# # Передавать функции в качестве аргументов и возвращать их из других функций:
#
# ___ higher_order func
#     print Получена функция || в качестве аргумента*;f__ func
#     f__
#     r_ f___
#
# h0000_o000 hello_world
# # Получена функция <function hello_world at 0x032C7FA8> в качестве аргумента
# # Hello world!
# # <function hello_world at 0x032C7FA8>