# # Декораторы - это просто функции
# ___ my_decorator func
#     print Я обычная функция
#
# ___ wrapper
#         print Я - функция, возвращаемая декоратором
#         fu000
#
#     r_ w000
#
#
# # Так что, мы можем вызывать её, не используя "@"-синтаксис:
#
# ___ lazy_function
#     print zzzzzzzz
#
#
# decorated_function _ my_000 l000_fu00
#
#
# # выведет: Я обычная функция
#
# # Данный код выводит "Я обычная функция", потому что это ровно то, что мы сделали:
# # вызвали функцию. Ничего сверхъестественного
#
# _m00
# ___ lazy_function
#     print zzzzzzzz
#
# # выведет: Я обычная функция