# # -*- coding: utf-8 -*-
#
# # Начальное состояние объекта следует создавать в
# # специальном методе-конструкторе __init__, который
# # вызывается автоматически после создания экземпляра
# # класса. Его параметры указываются при создании
# # объекта.
#
#
# # Класс, описывающий человека
# c_ Person
#     # Конструктор
#     ___ - ____ name age
#         ____.n... = n...
#         ____.a.. = a..
#
#     # Метод из прошлого примера
#     ___ print_info ____
#         print(____.n..., 'is', ____.a..
#
#
# # Создание экземпляров класса
# alex = ? 'Alex' 18
# john = ? 'John' 20
#
# # Вызов метода print_info
# a__.p..
# j__.p..