# # -*- coding: utf-8 -*-
# print("Введите слово 'stop' для получения результата")
# summa _ 0
# w___ T...
#     x _ in.. Введите число:
#     i_ ? ___ "stop"
#         br___ # Выход из цикла
#     i_ ? __ ""
#         print("Вы не ввели значение!")
#         c...
#     i_ ? 0 __ "-":  # Если первым символом является минус
#         i_ n__ ? 1;.isd.. # Если фрагмент не состоит из цифр
#             print("Необходимо ввести число, а не строку!")
#             c....
#     e____ # Если минуса нет, то проверяем всю строку
#         i_ n__ ?.isd..  # Если строка не состоит из цифр
#            print("Необходимо ввести число, а не строку!")
#            c_
#     x = in. ? # Преобразуем строку в число
#     s... +_ x
# print("Сумма чисел равна:" ?
# input()