# # -*- coding: utf-8 -*-
#
# ___ func e1, e2, e3
#     """ Суммирование элементов трех разных списков """
#     r_ e1 + e2 + e3 # Возвращаем новое значение
#
# arr1 = [1, 2, 3, 4, 5]
# arr2 = [10, 20, 30, 40, 50]
# arr3 = [100, 200, 300, 400, 500]
# print l..  m.. ? _1, _2 _3)
# # Результат выполнения: [111, 222, 333, 444, 555]
#
#
# ___ func e1, e2, e3
#     """ Суммирование элементов трех разных списков """
#     r_ e1 + e2 + e3
#
# arr1 = [1, 2, 3, 4, 5]
# arr2 = [10, 20]
# arr3 = [100, 200, 300, 400, 500]
# print l.. m.. ? _1 _2 _3
# # Результат выполнения: [111, 222]
#
#
# print(___ 1, 2, 3], 4, 5, 6], [7, 8, 9
# # <zip object at 0x00FCAC88>
# print l.. z. [1, 2, 3], [4, 5, 6], [7, 8, 9
# # [(1, 4, 7), (2, 5, 8), (3, 6, 9)]
#
#
# print l.. z.. 1, 2, 3], [4, 6], [7, 8, 9, 10
# # [(1, 4, 7), (2, 6, 8)]
#
