# # -*- coding: utf-8 -*-
#
# arr = [1, 2, 3]
# ?.ap.. 4; print(?)               # Добавляем число
# # [1, 2, 3, 4]
# ?.ap.. 5, 6 ; print(?)          # Добавляем список
# # [1, 2, 3, 4, [5, 6]]
# ?.ap.. 7, 8; print(?)          # Добавляем кортеж
# # [1, 2, 3, 4, [5, 6], (7, 8)]
#
#
# arr = [1, 2, 3]
# ?.ex.. 4, 5, 6                 # Добавляем список
# ?.ex.. 7, 8, 9                   # Добавляем кортеж
# ?.ex.. "abc"                       # Добавляем буквы из строки
# print(?)
# # [1, 2, 3, 4, 5, 6, 7, 8, 9, 'a', 'b', 'c']
#
#
# arr = [1, 2, 3]
# print(? + [4, 5, 6                   # Возвращает новый список
# # [1, 2, 3, 4, 5, 6]
# arr += [4, 5, 6]                         # Изменяет текущий список
# print ?
# # [1, 2, 3, 4, 5, 6]
#
#
# arr = [1, 2, 3]
# ? le. ? ; = [4, 5, 6]               # Изменяет текущий список
# print(?)
# # [1, 2, 3, 4, 5, 6]
#
#
# arr = [1, 2, 3]
# ?.in.. 0, 0; print(?)            # Вставляем 0 в начало списка
# # [0, 1, 2, 3]
# ?.in.. -1, 20 ; print(?)          # Можно указать отрицательные числа
# # [0, 1, 2, 20, 3]
# ?.in.. 2, 100 ; print(?)          # Вставляем 100 в позицию 2
# # [0, 1, 100, 2, 20, 3]
# ?.in.. 10, |4, 5 ; print(?)      # Добавляем список
# # [0, 1, 100, 2, 20, 3, [4, 5]]
#
#
# arr = [1, 2, 3]
# ?[:0] = [-2, -1, 0]
# print(?)
# # [-2, -1, 0, 1, 2, 3]
#
#
# arr = [1, 2, 3, 4, 5]
# print(?.p..                        # Удаляем последний элемент списка
# # 5
# print(?)                               # Список изменился
# # [1, 2, 3, 4]
# print(?.p.. 0                        # Удаляем первый элемент списка
# # 1
# print(?)                               # Список изменился
# # [2, 3, 4]
#
#
# arr = [1, 2, 3, 4, 5]
# del ? _ ; print(?)                   # Удаляем последний элемент списка
# # [1, 2, 3, 4]
# del ? _ _ ; print(?)                  # Удаляем первый и второй элементы
# # [3, 4]
#
#
# arr = [1, 2, 3, 1, 1]
# ?.r.. _                            # Удаляет только первый элемент
# print(?)
# # [2, 3, 1, 1]
# # arr.remove(5)                          # Такого элемента нет
# # Traceback (most recent call last):
# #   File "<pyshell#3>", line 1, in <module>
# #     arr.remove(5)    # Такого элемента нет
# # ValueError: list.remove(x): x not in list
#
#
# arr = [1, 2, 3, 1, 1]
# ?.c..
# print(?)
# # []
#
#
# arr = [1, 2, 3, 1, 1, 2, 2, 3, 3]
# s = se. ?                              # Преобразуем список во множество
# print(s)
# # {1, 2, 3}
# arr = l.. ?                           # Преобразуем множество в список
# print(?)                                 # Все повторы были удалены
# [1, 2, 3]