# # -*- coding: utf-8 -*-
#
# arr = [1, 2, 3, 4, 5]
# ?.r..                           # Изменяется текущий список
# print(?)
# # [5, 4, 3, 2, 1]
#
#
# arr = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10]
# print r__d ?
# # <list_reverseiterator object at 0x00FD5150>
# print l.. r__d ?              # Использование функции list()
# # [10, 9, 8, 7, 6, 5, 4, 3, 2, 1]
# ___ i __ r__d?
#     print ? e.._" "                   # Вывод с помощью цикла
#
# # 10 9 8 7 6 5 4 3 2 1
# print i ___ ? __ r__d ?              # Использование генератора списков
# # [10, 9, 8, 7, 6, 5, 4, 3, 2, 1]
#
#
# _______ ra..                          # Подключаем модуль random
# arr = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10]
# ra__.sh.. ?                      # Перемешиваем список случайным образом
# print ?
# # [2, 7, 10, 4, 6, 8, 9, 3, 1, 5]
