# # -*- coding: utf-8 -*-
#
# c_ MyClass                   # Определяем пустой класс
#     p__
# MyClass.x = 50                   # Создаем атрибут объекта класса
# c1, c2 = ?, ?   # Создаем два экземпляра класса
# c1.y = 10                        # Создаем атрибут экземпляра класса
# _2.y = 20                        # Создаем атрибут экземпляра класса
# print(_1.x, _1.y)                # Выведет: 50 10
# print(_2.x, _2.y)                # Выведет: 50 20
#
#
# c_ MyClass
#     x = 10                       # Атрибут объекта класса
#     ___ - ____
#         self.y = 20              # Атрибут экземпляра класса
#
#
# c1 = ?                 # Создаем экземпляр класса
# c2 = ?                   # Создаем экземпляр класса
#
#
# print(_1.x, _2.x)                # 10 10
# ?.x = 88                   # Изменяем атрибут объекта класса
# print(_1.x, _2.x)                # 88 88
#
#
# print(_1.y, _2.y)                # 20 20
# _1.y = 88                        # Изменяем атрибут экземпляра класса
# print(_1.y, _2.y)                # 88 20
#
#
# ?.x = 88                   # Изменяем атрибут объекта класса
#
#
# _1.x = 200                       # Создаем атрибут экземпляра
#
#
# print(_1.x, ?.x)           # 200 88