# # -*- coding: utf-8 -*-
#
# # generator-expressions
#
# # Некоторые простые генераторы могут быть записаны в виде выражения.
# # Они выглядят как выражение, содержащее некоторые переменные, после
# # которого одно или несколько ключевых слов for, задающих, какие значения
# # должны принимать данные переменные  синтаксис соответствует заголовку
# #     цикла for , и ноль или несколько условий, фильтрующих генерируемые
# # значения  синтаксис соответствует заголовку оператора if . Такие выражения
# # называются выражениями-генераторами  generator expressions .
# #
# # x, y
# generator _  ? ** 2 + ? ___ ? __ ra... 2, 7  ___ ? __ ra... 3  __ ? !_ 6
# ___ number __ ?
#     print ?
#
# print
#
# print su. 2 * ? ___ ? __ ra... 5
#
# # delegating-to-subgenerator
#
# # В Python 3 существуют так называемые подгенераторы  subgenerators .
# # Если в функции-генераторе встречается пара ключевых слов yield from,
# # после которых следует объект-генератор, то данный генератор делегирует
# # доступ к подгенератору, пока он не завершится  не закончатся его значения ,
# # после чего продолжает своё исполнение.
# #
# #
# # x
# ___ generator
#     y_ f..   3 * ? ___ ? __ ra... 5
#     y_ f..   2 * ? ___ ? __ ra... 5, 10
#
#
# # i
# ___ ? __ ?
#     print ?
