# -*- coding: utf-8 -*-

# # Список – упорядоченная последовательность определённых значений, которые
# # могут повторяться. Количество элементов списка может быть произвольным.
# #
# # Для создания списка следует записать его элементы
# # через запятую в квадратных скобках.
#
# # int_list – список из четырёх целых чисел
# int_list _ 1, 2, 3, 5
# # char_list – список, состоящий из четырёх символов
# char_list _ 'a', 'c', 'z', 'x'
# # empty_list – пустой список
# empty_list =
#
# print('Список чисел:', i...
# print('Список символов:', c..
# print('Пустой список:', e..