# # -*- coding: utf-8 -*-
#
# d = di.. ; print(d)                 # Создаем пустой словарь
# # {}
# d = di.. a 1 b 2 ; print(d)
# # {'a': 1, 'b': 2}
# d = di.. a 1 b 2 ; print(d)     # Словарь
# # {'a': 1, 'b': 2}
# d = di.. a 1 b 2 ; print(d) # Список кортежей
# # {'a': 1, 'b': 2}
# d = di.. a 1, b 2; print(d) # Список списков
# # {'a': 1, 'b': 2}
#
#
# k = ["a", "b"]                           # Список с ключами
# v = [1, 2]                               # Список со значениями
# print(li.. z.. ? ?                   # Создание списка кортежей
# # [('a', 1), ('b', 2)]
# d = di.. z.. ? ? print ?           # Создание словаря
# # {'a': 1, 'b': 2}
#
#
# d _ ; print(d)                         # Создание пустого словаря
# # {}
# d = { "a": 1, "b": 2 }; print(d)
# # {'a': 1, 'b': 2}
#
# d = {}                                   # Создаем пустой словарь
# d["a"] = 1                               # Добавляем элемент1 (ключ "a")
# d["b"] = 2                               # Добавляем элемент2 (ключ "b")
# print(d)
# # {'a': 1, 'b': 2}
#
#
# d = di...f_k_ "a", "b", "c"
# print(d)
# # {'a': None, 'c': None, 'b': None}
# d = di...? "a", "b", "c"|, 0     # Указан список
# print(d)
# # {'a': 0, 'c': 0, 'b': 0}
# d = di...? "a", "b", "c"|, 0     # Указан кортеж
# print(d)
# # {'a': 0, 'c': 0, 'b': 0}
#
#
# d1 = d2 = a 1 b 2              # Якобы создали два объекта
# d2["b"] = 10
# print(d1, d2)                              # Изменилось значение в двух переменных !!!
# # ({'a': 1, 'b': 10}, {'a': 1, 'b': 10})
#
#
# d1, d2 = {"a": 1, "b": 2}, {"a": 1, "b": 2}
# d2["b"] = 10
# print(d1, d2)
# # ({'a': 1, 'b': 2}, {'a': 1, 'b': 10})
