# # -*- coding: utf-8 -*-
#
# d = x 1 y 2 z 3
# ___ key __ ?.?          # Использование метода keys()
#     print("(@ => @)".f.. ? ? |k..  e.._" "
# # Выведет: (y => 2) (x => 1) (z => 3)
# print()                       # Вставляем символ перевода строки
# ___ key __ ?                 # Словари также поддерживают итерации
#     print("(@ => @)".f... ? ? |k.. e.._" "
# # Выведет: (y => 2) (x => 1) (z => 3)
#
#
# d = {"x": 1, "y": 2, "z": 3}
# k = li.. ?.?           # Получаем список ключей
# ?.?                     # Сортируем список ключей
# ___ key __ ?
#     print("(@ => @)".f... ?, ? |k.. e.._" "
# # Выведет: (x => 1) (y => 2) (z => 3)
#
#
# d = x 1 y 2 z 3
# ___ key __ so.. ?.k..
#     print("(@ => @)".f... ? ? |k.. e.._" "
# # Выведет: (x => 1) (y => 2) (z => 3)
#
#
# d = x 1 y 2 z 3
# ___ key __ so.. ?
#     print("(@ => @)".f... ? ? |k.. e.._" "
# # Выведет: (x => 1) (y => 2) (z => 3)
