# An example of using function generators

# ___ func x y
#     ___ i __ ra.. 1 x+1
#         y_ i ** y
# ___ n __ ? 10 2
#     print ? e.._" "    # Выведет: 1 4 9 16 25 36 49 64 81 100
# print()                  # Вставляем пустую строку
# ___ n __ ? 10 3
#     print ? e.._" "    # Выведет: 1 8 27 64 125 216 343 512 729 1000
#
# print()
# ######################################################################################################################
#  Using the __next __ () parameter

# ___ func x y
#     ___ i __ ra.. 1 x + 1
#         y_ i ** y
#
# i = ? 3 3
# print ?. -n  # Выведет: 1 (1 ** 3)
# print ?. -n  # Выведет: 8 (2 ** 3)
# print ?. -n  # Выведет: 27 (3 ** 3)
# # print ?. -n  # Исключение StopIteration
#
# print()
# ######################################################################################################################
#  Calling one generator function fro… (simple case)

# ___ gen l
#     ___ e __ ?
#         y_ f_ ra.. 1 e + 1
#
# l = [5, 10]
# ___ i __ ? 5, 10|| print i e.._" ")
#
# print()
# ######################################################################################################################
# Calling one function generator fro…er (hard case)

# ___ gen2 n
#     ___ e __ ra.. 1 ? + 1
#         y_ e * 2
#
# ___ gen l
#     ___ e __ ?
#         y_ f_ ?2 ?
#
# l = [5, 10]
# ___ i __ ? 5, 10|| print i e.._" "
#
# print()