# # -*- coding: utf-8 -*-
# 
# str1 = 'hel'
# str2 = 'lo'
# result = str1 + str2  # конкатенация строка
# print(result)
# 
# 
# # форматирование строк
# 
# a = 48
# b = 73
# 
# message1 _ '$ + $ = $' $ a, b, a + b
# print ?
# 
# message2 = '@ - @ = @'.f... a, b, a - b
# print ?
# 
# 
# # индексация строк
# 
# s = 'Hello, World!'
# 
# # (вернуться в седьмом уроке)
# print ? 0    # индексация начинается с нуля
# print ? 4   # четвёртый (пятый логически) элемент (символ)
# print ? -1  # отрицательные числа – индексация с конца
# 
# print ? 2 7    # символы со второго (включительно) по пятый (не включительно)
# print ? 2 7 _  # то же, но с шагом два
