# # -*- coding: utf-8 -*-
#
# """Пример использования sys.path
#
# При импортировании модулей интерпретатор Python ищет их в директориях и архивах,
# список которых доступен как для чтения, так и для модификации в виде переменной
# path встроенного модуля sys.
# """
#
# _______ ___      # встроенный модуль sys
# _______ __.pa..  # функции для работы с путями в файловой системе
#
# print(___.pa..  # вывод списка путей поиска модулей
#
# # Получение имени директории текущего модуля.
# # __file__ -- путь к файлу текущего модуля
# current_dir = __.pa__.d.. -f
#
# # Получение пути к первому примеру
# example_00_path = __.pa__.j.. __.pa__.d..  ? 00_Module
#
# # Добавление к пути поиска модулей
# ___.pa__.ap.. ?
#
# # Импортирование модуля fibonacci
# _______ fibonacci
#
# # Вызов его функции
# print(?.n... 20
