# # # -*- coding: utf-8 -*-
#
# ______ __
# __.g.c.             # Текущий рабочий каталог
# # 'C:\\book'
#
#
# __.c.d.("C:\\book\\folder1\\")
# __.g.c.               # Текущий рабочий каталог
# # 'C:\\book\\folder1'
# # ######################################################################################################################
#
# __.m.d.("newfolder")     # Создание каталога
# __.r.d.("newfolder") # Удаление каталога
#
# __.l.d.("C:\\book\\folder1\\")
# # ['file1.txt', 'file2.txt', 'file3.txt', 'folder1', 'folder2']
# # ######################################################################################################################
#
# ___ p, d, f) i_ __.wa.. "C:\\book\\folder1\\"
#     print p
#
# # C:\book\folder1\
# # C:\book\folder1\folder1_1
# # C:\book\folder1\folder1_1\folder1_1_1
# # C:\book\folder1\folder1_1\folder1_1_2
# # C:\book\folder1\folder1_2
# # ######################################################################################################################
#
# ___ p, d, f) i_ __.wa.. "C:\\book\\folder1\\" F..
#     print(p)
#
# # C:\book\folder1\folder1_1\folder1_1_1
# # C:\book\folder1\folder1_1\folder1_1_2
# # C:\book\folder1\folder1_1
# # C:\book\folder1\folder1_2
# # C:\book\folder1\
# # ######################################################################################################################
#
#
# ______ __
# ___ p, d, f) i_ __.wa.. "C:\\book\\folder1\\", F...
#     ___ file_name i_ f # Удаляем все файлы
#         __.re.. __.pa__.jo.. p ?
#     ___ dir_name i_ d # Удаляем все каталоги
#         __.r.d. __.pa__.jo.. p ?
#
#
# ________ sh...
# sh___.r.t..("C:\\book\\folder1\\")
#
#
# f___ __.pa__ ______ n.c.
# n.c. _"c:/BoOk/fIlE.TxT")
# # 'c:\\book\\file.txt'
# # ######################################################################################################################
#
# ________ __.pa__
# __.pa__.i.d. _"C:\book\file.txt")
# # False
# __.pa_.i.d. "C:\\book\\")
# # True
# # ######################################################################################################################
#
# __.pa__.i.f. _"C:\book\file.txt")
# # True
# __.pa__.i.f. "C:\\book\\")
# # False
# # ######################################################################################################################