# -*- coding: utf-8 -*-

# # Можно получить группу элементов по их индексам.
# # Эта операция называется срезом списка (list slicing).
#
# # Создание списка чисел
# my_list _ 5, 7, 9, 1, 1, 2
#
# # Получение среза списка от нулевого (первого) элемента (включая его)
# # до третьего (четвёртого) (не включая)
# sub_list = ? _ _
# # Вывод полученного списка
# print s..
#
# # Вывод элементов списка от второго до предпоследнего
# print ? _ -_
# # Вывод элементов списка от четвёртого (пятого) до пятого (шестого)
# print ? _ _ _