# -*- coding: utf-8 -*-

# # Любой из параметров среза можно пропускать
# # (при условии соблюдения правильной расстановки двоеточий).
# # Значение по умолчанию для начала списка – 0,
# # конца списка – длина списка, шага – 1.
#
# # Создание списка чисел
# my_list _ 5, 7, 9, 1, 1, 2
#
# # Вывод элементов списка от второго (третьего) значения до конца списка
# print ? _  # [9, 1, 1, 2]
# # Вывод всех элементов списка от начала до предпоследнего элемента
# print ? -_ # [5, 7, 9, 1]
# # Вывод всех элементов списка в обратном порядке
# print ? -_  # [2, 1, 1, 9, 7, 5]