# -*- coding: utf-8 -*-

# # Создание списка чисел
# my_list _ 5, 1, 5, 7, 8, 1, 0, -23
#
# # Вывод списка
# print ?
#
# # Получение длины списка
# length _ __ ?
#
# # Ввод индекса
# index = ?
# w__ n__ -l.. <= ? < l..
#     ? _ in. in.. Введите индекс элемента списка (от __ до __): '
#                       _ (-l.. l... - 1
#
# # Ввод нового значения
# value = in. in..Введите новое значение заданного элемента:
#
# # Изменение элемента списка
# m.. i.. = ?
#
# # Вывод списка на экран
# print m..