# # -*- coding: utf-8 -*-
#
# arr = [1, 2, 3, 4, 5]
# ___ i __ ?
#     print ? e.._" "
#
# # 1 2 3 4 5
#
#
# arr = [1, 2, 3, 4]              # Элементы имеют неизменяемый тип (число)
# ___ i __ ?
#     ? += 10
#
# print ?                     # Список не изменился
# # [1, 2, 3, 4]
# arr = [[1, 2], [3, 4]]          # Элементы имеют изменяемый тип (список)
# ___ i __ ?
#     ? 0 +_ 10
# print ?                      # Список изменился
# # [[11, 2], [13, 4]]
#
#
# arr = [1, 2, 3, 4]
# ___ i __ ra.. le. ?
#     ? ? *_ 2
# print ?                   # Результат выполнения: [2, 4, 6, 8]
#
#
# arr = [1, 2, 3, 4]
# ___ i, elem __ en.. ?
#     ? ? *_ 2
# print ?                   # Результат выполнения: [2, 4, 6, 8]
#
#
# arr = [1, 2, 3, 4]
# i, c = 0, le. ?
# w___ i < c
#     ? ? *_ 2
#     ? +_ 1
# print ?                   # Результат выполнения: [2, 4, 6, 8]