# # -*- coding: utf-8 -*-
#
# arr = [1, 2, 3, 4]
# ___ i __ ra.. le. ?
#     ? ? *_ 2
# print ?                   # Результат выполнения: [2, 4, 6, 8]
#
#
# arr = [1, 2, 3, 4]
# arr =  i * 2 ___ ? __ ?
# print(?)                   # Результат выполнения: [2, 4, 6, 8]
#
#
# arr = [1, 2, 3, 4]
# arr =  i * 10 ___ ? __ ? i_ ? % 2 __ 0
# print(?)                   # Результат выполнения: [20, 40]
#
#
# arr
# ___ i __ 1, 2, 3, 4
#     i_ ? % 2 __ 0           # Если число четное
#         ?.ap.. ? * 10   # Добавляем элемент
# print(?)                   # Результат выполнения: [20, 40]
#
#
# arr = [[1, 2], [3, 4], [5, 6]]
# arr =  j * 10 ___ i __ ? ___ j __ i i_ j % 2 __ 0
# print(?)                   # Результат выполнения: [20, 40, 60]
#
#
# arr
# ___ i __ 1, 2], [3, 4], [5, 6
#     ___ j __ i
#         i_ j % 2 __ 0:          # Если число четное
#             ?.ap.. j * 10  # Добавляем элемент
# print(?)                      # Результат выполнения: [20, 40, 60]
#
#
# arr = [1, 4, 12, 45, 10]
# print su. i ___ i __ ? i_ i % 2 __ 0
# #
