#  map

# ___ work value
#     r_ value * 2

# t = [1, 2, 10]
# m _ m_ work t
# print m

# print()
# ######################################################################################################################
# map  but using lambda function

# m1 = m_|l_ x x * 2 t
# print(l_ m1

# print()

# ######################################################################################################################
# Пример использования функции map

# string _ '2 4 8 15 42'
# numbers _ m_|i_ s_.s_
# print l_ numbers
#
# print()

# ######################################################################################################################
# Map using a list comprehension

# l = [1, 2, 3, 4, 5]
# result _ |f_(i) ___ i __ l|
# print result
#
# print()

