# # -*- coding: utf-8 -*-
#
# d = x 1 y 2 z 3
# ___ key __ ?.keys          # Использование метода keys()
#     print("(@ => @)".f.. ? ? |k..  e.._" "
# # Выведет: (y => 2) (x => 1) (z => 3)
# print()                       # Вставляем символ перевода строки
# ___ key __ d                 # Словари также поддерживают итерации
#     print("(@ => @)".f... ? ? |k.. e.._" "
# # Выведет: (y => 2) (x => 1) (z => 3)
#
#
# d = {"x": 1, "y": 2, "z": 3}
# k = li.. ?.k..           # Получаем список ключей
# ?.s..                     # Сортируем список ключей
# ___ key __ k
#     print("(@ => @)".f...(?, ? |k.. e.._" "
# # Выведет: (x => 1) (y => 2) (z => 3)
#
#
# d = x 1 y 2 z 3
# ___ key __ so.. ?.k..
#     print("(@ => @)".f...(? ? |k.. e.._" "
# # Выведет: (x => 1) (y => 2) (z => 3)
#
#
# d = x 1 y 2 z 3
# ___ key __ so.. ?
#     print("(@ => @)".f... ? ? |k.. e.._" "
# # Выведет: (x => 1) (y => 2) (z => 3)